app/controllers/expenses_controller.rb

SELECT * FROM "expenses" ORDER BY date DESC, name DESC
SELECT sum("expenses".price) AS sum_price FROM "expenses"
---
  def index
    @expenses = Expense.all(:order => "date DESC")

SELECT sum("expenses".price) AS sum_price FROM "expenses" WHERE (name LIKE 'Benz%')
SELECT sum("expenses".price) AS sum_price FROM "expenses" WHERE ("expenses"."date" BETWEEN '2010-02-01' AND '2010-02-28')
SELECT sum("expenses".price) AS sum_price FROM "expenses" WHERE ("expenses"."name" = 'Benz%')
---
  def stats
    @total = Expense.sum('price')

    range = Date.today.beginning_of_month..Date.today.end_of_month

    @current_month = Expense.sum('price', :conditions => {:date => range})
    @benzin = Expense.sum('price', :conditions => "name LIKE 'Benz%'")

SELECT * FROM "expenses" WHERE ("expenses"."id" = 1)
---
  def show
    @expense = Expense.find(params[:id])

SELECT * FROM "expenses" WHERE ("expenses"."id" = 23)
---
  def edit
    @expense = Expense.find(params[:id])

INSERT INTO "expenses" ("name", "price", "created_at", "updated_at", "date") VALUES('Plavání', 2320.0, '2010-01-05 19:48:39', '2010-01-05 19:48:39', '2010-01-05')
---
  def create
    @expense = Expense.new(params[:expense])

    respond_to do |format|
      if @expense.save

SELECT * FROM "expenses" WHERE ("expenses"."id" = 23)
UPDATE "expenses" SET "updated_at" = '2010-01-11 21:07:11', "date" = '2010-01-10' WHERE "id" = 23
---
  def update
    @expense = Expense.find(params[:id])

    respond_to do |format|
      if @expense.update_attributes(params[:expense])